{"name":"settings","description":"Settings database for search","items":[{"id":"b88d36943a06d0c3","page":"stream","tab":"general","label":"Enable Quick Posting on Dashboard","description":"This option determines if quick posting should be enabled for users to quickly post into group, events or pages directly from their dashboard","keywords":"enable quick posting dashboard this post their from directly pages events group into quickly"},{"id":"5db73edb93519f39","page":"stream","tab":"general","label":"Enable Bookmarking On Stream","description":"Allow users to bookmark stream items","keywords":"enable bookmarking stream allow users bookmark stream items"},{"id":"639d878fcc840356","page":"stream","tab":"general","label":"Enable Pinning Stream Items","description":"Enable or disable pin feature on stream items.","keywords":"enable pinning stream items enable disable pin feature stream items"},{"id":"3779b8b2f50e32ff","page":"stream","tab":"general","label":"Include Postings On Private Clusters In Dashboard","description":"When this option is activated, posts made in private clusters would appear on the dashboard and profile if the current viewer is allowed to see it. If it is disabled, it will be hidden altogether.","keywords":"include postings private clusters dashboard the when and hidden will disabled see allowed viewer current"},{"id":"39b1210676e671b6","page":"stream","tab":"general","label":"Enable RSS","description":"When this option is enabled, users will be able to subscribe to the stream via RSS","keywords":"enable rss when this option enabled users will able subscribe the stream"},{"id":"554426b04404c645","page":"stream","tab":"general","label":"Exclude Site Admin's Stream From Appearing","description":"Determines whether the system will exclude the stream made by site admin of the site.","keywords":"exclude site admins stream from appearing the site determines whether system will exclude stream made admin"},{"id":"7ac3495ccfb5d1c2","page":"stream","tab":"general","label":"Enable Automated Archiving","description":"This option determines if automated archiving should be enabled. When enabled, EasySocial will archive stream items when the cronjob executes","keywords":"enable automated archiving enabled when this option determines automated archiving should easysocial will"},{"id":"2c7d53566ed2014a","page":"stream","tab":"general","label":"Archive Items Older Than","description":"Archive the stream item if the stream creation date more than the specified number of months.","keywords":"archive items older than the stream archive item creation date more than specified number"},{"id":"2b63fc26e94e58d4","page":"stream","tab":"general","label":"Archive Items Limit","description":"Determines how many stream items to archive each time the cron executes.","keywords":"archive items limit determines how many stream items archive each time the cron"},{"id":"2f5cad0261310ac9","page":"stream","tab":"general","label":"Enable Push To Top on Reactions","description":"When enabled, system will push the stream item to top when user perform reactions to the stream item.","keywords":"enable push top reactions when the stream item enabled system will push top user"},{"id":"aacedb27a5bff117","page":"stream","tab":"general","label":"Hashtag Custom Filter Behaviour","description":"Specify the behavior on custom hashtag filtering to follow 'OR' rule (default) or 'AND' rule.","keywords":"hashtag custom filter behaviour rule specify the behavior custom hashtag filtering follow default and"},{"id":"8f687bfaa9ff35b2","page":"stream","tab":"general","label":"Enable Copy Link of Single Stream Item","description":"This option determines if the copy link of single stream item should be enabled.","keywords":"enable copy link single stream item this option determines the copy link single stream item should"},{"id":"fdb920013ca5a551","page":"stream","tab":"general","label":"Enable Auto Loading During Scroll","description":"If this option is enabled, when a user scrolls down to the bottom of the page, the system will automatically load previous stream items.","keywords":"enable auto loading during scroll the this system stream previous load automatically will bottom page"},{"id":"12ad9074a51088cf","page":"stream","tab":"general","label":"Ordering","description":"This option determines the ordering behavior for activity streams throughout the site","keywords":"ordering the this option determines ordering behavior for activity streams throughout"},{"id":"2608167558a06a2d","page":"stream","tab":"general","label":"Total Activities To Load","description":"Set the duration of items that should be loaded by default. Upon clicking on load more, the system would automatically pick up feed items based on the length specified here.","keywords":"total activities load the items set system specified length based feed pick automatically"},{"id":"0d40137a4f27e51e","page":"stream","tab":"general","label":"Enable Azure Text Translator","description":"This option determines if Azure translations should be enabled. When enabled, a translate link would appear beneath each of the stream item.","keywords":"enable azure text translator enabled this would stream the each beneath appear translate link"},{"id":"504be9d805cd8547","page":"stream","tab":"general","label":"Subscription Key","description":"Here you will need to paste the client secret for your Bing app.","keywords":"subscription key here you will need paste the client secret for your"},{"id":"457cf9ebac59bdb8","page":"stream","tab":"general","label":"Always Display Translations Link","description":"Regardless of the language used by the user or the site, the translations link will always be visible by the user.","keywords":"always display translations link the user regardless language used site translations link will always"},{"id":"8f979f9806325390","page":"stream","tab":"layout","label":"Enable Custom Backgrounds","description":"This option determines if EasySocial would allow users on the site to pick a custom background when posting their status updates","keywords":"enable custom backgrounds this pick status their posting when background custom site option"},{"id":"9d6fa580386a2547","page":"stream","tab":"layout","label":"Limit Story Panels","description":"This option determines if EasySocial should limit the number of story panel buttons that appears on the story form","keywords":"limit story panels story the this option determines easysocial should limit number panel"},{"id":"a2567f6512337caa","page":"stream","tab":"layout","label":"Story Types Initial Limit","description":"This option determines the total number of story types that should be visible on the story form","keywords":"story types initial limit story the this option determines total number types that should"},{"id":"0eed2d99eea96044","page":"stream","tab":"layout","label":"Allow User to Set Favourite Panels","description":"This option determines if users are allowed to manage their favourite panels on the story form. By disallowing this, user's would not be able to update the favourite panels","keywords":"allow user set favourite panels this favourite the panels users are allowed manage their option"},{"id":"638a60186dd612e4","page":"stream","tab":"layout","label":"Display Mentions In Form","description":"Determines if the name mentions should be enabled.","keywords":"display mentions form determines the name mentions should enabled"},{"id":"cd5b2587e93c6a70","page":"stream","tab":"layout","label":"Display Location In Form","description":"Determines if the location should appear in the story form.","keywords":"display location form the determines location should appear story form"},{"id":"2452e08d16b52d7d","page":"stream","tab":"layout","label":"Display Mood In Form","description":"Deterines if moods should be enabled in the story form.","keywords":"display mood form deterines moods should enabled the story form"},{"id":"9c5a68e703af266e","page":"stream","tab":"layout","label":"Display Giphy in Form","description":"Display Giphy in Form_DESC","keywords":"display giphy form display giphy formdesc"},{"id":"53834a9233f59377","page":"stream","tab":"layout","label":"Automatically Truncate Content","description":"Determines if the system should automatically truncate long text posted on the stream updates.","keywords":"automatically truncate content the determines system should automatically truncate long text posted stream"},{"id":"2fbebd94f310f443","page":"stream","tab":"layout","label":"Truncate Content At Specified Length","description":"This will allow the system to automatically truncate long text posted on the stream updates when it exceeds the specified number of characters.","keywords":"truncate content specified length the this stream number specified exceeds when updates text posted"},{"id":"3df6e054296c3b46","page":"stream","tab":"layout","label":"Timestamp Format","description":"Determines the date display style in frontend","keywords":"timestamp format determines the date display style frontend"},{"id":"cef7820a2f3b8ce8","page":"stream","tab":"layout","label":"Datetime format","description":"Determines the format of datetime when normal datetime style selected.","keywords":"datetime format datetime determines the format when normal style selected"},{"id":"e0aa3b39e2c389d9","page":"stream","tab":"layout","label":"Location Preview Style","description":"Determines the location preview in stream item","keywords":"location preview style determines the location preview stream item"},{"id":"2045feb498401923","page":"photos","tab":"general","label":"Enable Photos","description":"Enable this to allow users to utilize the photos functionality in the system.","keywords":"enable photos the enable this allow users utilize photos functionality system"},{"id":"7e1fdec8ca02e81d","page":"photos","tab":"general","label":"Enable People Tagging","description":"This option determines if the tagging feature is enabled for photos and albums on the site","keywords":"enable people tagging the this option determines tagging feature enabled for photos and"},{"id":"180da10b308fae06","page":"photos","tab":"general","label":"Allow Locations","description":"This option determines if location should be enabled for photos and albums","keywords":"allow locations this option determines location should enabled for photos and albums"},{"id":"1d4a7aae8b798ab6","page":"photos","tab":"general","label":"Import EXIF Data","description":"By enabling this option, EXIF data will be collected from the photo when the user uploads the photo. By disabling this, EXIF data will not be collected from the photo.","keywords":"import exif data the photo this exif data will collected from enabling option"},{"id":"8c3350b4ed8d66df","page":"photos","tab":"general","label":"Allow Viewing Of Original Photo","description":"This determines if the view original photos should be enabled on the photo.","keywords":"allow viewing original photo the this determines view original photos should enabled photo"},{"id":"80ef93afc37f0ff7","page":"photos","tab":"general","label":"Allow Downloading Photos","description":"If this option is enabled, users will able to download photos when they are viewing the photo.","keywords":"allow downloading photos this option enabled users will able download photos when they"},{"id":"d179dc6f6f6cfa61","page":"photos","tab":"general","label":"Total Photos To Display Per Page","description":"The amount of photos to show when clicking load more button.","keywords":"total photos display per page the amount photos show when clicking load more button"},{"id":"b308c31d40b4dbf6","page":"photos","tab":"general","label":"Allow Animated Gif Processing","description":"If this options is enabled, EasySocial will try to process animated gif during photos upload. Please note that you will need a valid API key in order to enable this feature.","keywords":"allow animated gif processing this will note enable order key api valid need you"},{"id":"7ffd140a7ac18f6b","page":"photos","tab":"general","label":"Enable Image Optimizer","description":"This option determines if the image optimization should be enabled on the site","keywords":"enable image optimizer the this option determines image optimization should enabled site"},{"id":"2834119d1f20f6b1","page":"photos","tab":"general","label":"Image Compression Service Key","description":"Enter the service key provided to you on the Image Compression page on StackIdeas website","keywords":"image compression service key the enter service key provided you image compression page stackideas"},{"id":"968fdb64b8c624d4","page":"photos","tab":"general","label":"Upload Quality","description":"This option determines the quality of the photo when the photos are being resized on the site","keywords":"upload quality the this option determines quality photo when photos are being"},{"id":"4424012dc1f52b12","page":"photos","tab":"layout","label":"Photo ordering","description":"Determine the ordering of the photos in album page","keywords":"photo ordering the determine ordering photos album page"},{"id":"bdbfa20a5aa9f1d5","page":"photos","tab":"layout","label":"Photo Image Source Size","description":"Determines the photo to be used when displayed on the stream item. Choose smaller size for faster stream image loading.","keywords":"photo image source size stream the determines photo used when displayed item choose smaller"},{"id":"b19a1a47c8632a72","page":"photos","tab":"layout","label":"Photos Display Pattern","description":"Determines the arrangement of photos when they are placed together.","keywords":"photos display pattern determines the arrangement photos when they are placed together"},{"id":"c8789b9a2e2923bc","page":"photos","tab":"layout","label":"Photo Aspect ratio","description":"Determines the aspect ratio of blocks where photos are displayed within it.","keywords":"photo aspect ratio determines the aspect ratio blocks where photos are displayed within"},{"id":"1912807e63da04d4","page":"photos","tab":"layout","label":"Resize Mode","description":"Determines if images in stream should stretch to fill or fit within the provided container.","keywords":"resize mode determines images stream should stretch fill fit within the provided"},{"id":"1b1f5a8f35e8ddcb","page":"photos","tab":"layout","label":"Photo Resize Threshold","description":"Determines if small images should display using its exact size without further resizing. The threshold here also applies to images in stream and story.","keywords":"photo resize threshold images determines resizing and stream applies also here threshold the"},{"id":"2f6cf5f15db19573","page":"photos","tab":"layout","label":"User Photo Album's Limit","description":"Set the number of album to show on the user profile album sidebar area.","keywords":"user photo albums limit the album set number show user profile sidebar area"},{"id":"8e0370107874ac7e","page":"photos","tab":"layout","label":"Affix Header Position Placement","description":"Determine the position offset of the affix header from the top of the page. Adjust the offset (in pixel) if the site contain fixed top element such as Docker toolbar.","keywords":"affix header position placement the offset top determine site docker such element fixed contain"},{"id":"62643f01c8f6404b","page":"events","tab":"general","label":"Enable Events","description":"Determines if the events system should be enabled on the site.","keywords":"enable events the determines events system should enabled site"},{"id":"f7984d48505769a2","page":"events","tab":"general","label":"Enable iCal Export","description":"Determines if the export to iCal button should show in events.","keywords":"enable ical export determines the export ical button should show events"},{"id":"8bc6a5002c21da86","page":"events","tab":"general","label":"Allow Attendees To Invite","description":"This option determines if event members would be allowed to invite others to attend events","keywords":"allow attendees invite this option determines event members would allowed invite others attend"},{"id":"6f012c5addf44aac","page":"events","tab":"general","label":"Allow Inviting Non Friends","description":"This option determines if users are allowed to invite other users who are not their friends","keywords":"allow inviting non friends users are this option determines allowed invite other who not"},{"id":"a0eed4ad25916542","page":"events","tab":"general","label":"Calendar Start of Week","description":"Set which day marks the starting day of the week.","keywords":"calendar start week day the set which marks starting week"},{"id":"37c598bb64e75fb5","page":"events","tab":"general","label":"Recurring Limit","description":"Set the maximum number of event allowed for recurring. Avoid putting large numbers here to prevent huge server load.","keywords":"recurring limit set putting server huge prevent here numbers large avoid the"},{"id":"b8773a136a22a008","page":"events","tab":"general","label":"Explicitly Display Site Admin’s Story Posting","description":"If enabled, story posting from site admins will appear in cluster page.","keywords":"explicitly display site admins story posting enabled story posting from site admins will appear cluster page"},{"id":"4037c8aef2673a1c","page":"events","tab":"general","label":"Enable Reminders","description":"When this option is activated, user will be reminded when their event is approaching 3 days in advance. This option requires cronjob to be active","keywords":"enable reminders when this option activated user will reminded their event approaching"},{"id":"11beb1dd294a83a3","page":"events","tab":"general","label":"Display Social Buttons On Private & Invite Only","description":"This option determines if the social buttons should appear on private and invite only","keywords":"display social buttons private invite only this option determines the social buttons should appear private and"},{"id":"b63e4b6bac4ee657","page":"events","tab":"general","label":"Default Radius For Nearby Events","description":"Deteremine the default radius (in miles) for the nearby events","keywords":"default radius for nearby events the deteremine default radius miles for nearby events"},{"id":"485fafad9688470a","page":"events","tab":"general","label":"Allow Tagging Non Friends","description":"Determines whether non-friends can be tagged under comments in public events","keywords":"allow tagging non friends determines whether nonfriends can tagged under comments public events"},{"id":"02d8f33495a7e2b3","page":"events","tab":"layout","label":"Default Avatar","description":"Upload a custom default avatar","keywords":"default avatar upload custom default avatar"},{"id":"f63968ca35f43af3","page":"events","tab":"layout","label":"Default Cover","description":"Upload a custom default cover","keywords":"default cover upload custom default cover"},{"id":"9ac623980f805ec8","page":"events","tab":"layout","label":"Default Tab","description":"Select the default tab that should be visible when the item is being accessed","keywords":"default tab the select default tab that should visible when item being"},{"id":"ccc1de64cafe1707","page":"events","tab":"layout","label":"Default Editor For Event Descriptions","description":"Select an editor that you would like to use for the Event Descriptions.","keywords":"default editor for event descriptions select editor that you would like use for the event"},{"id":"e94eb2f9dfdf4c97","page":"events","tab":"layout","label":"Display End Date","description":"Determines if the end date of the event should be displayed.","keywords":"display end date the determines end date event should displayed"},{"id":"36c37d6e1b3c851b","page":"events","tab":"layout","label":"Display Timezone","description":"Determines if the timezone of the event should be displayed.","keywords":"display timezone the determines timezone event should displayed"},{"id":"3fdd5f2737e01d4e","page":"events","tab":"layout","label":"Display Time","description":"Determines if the time of the event should be displayed.","keywords":"display time the determines time event should displayed"},{"id":"b70a60e12b9311e9","page":"events","tab":"layout","label":"Display Time Format","description":"Specify the time format to display for events.","keywords":"display time format specify the time format display for events"},{"id":"4e3c78d297b88c96","page":"events","tab":"layout","label":"Display Hit Counter","description":"This option will enable the hit counter from displaying under the event pages.","keywords":"display hit counter the this option will enable hit counter from displaying under"},{"id":"078043fcf890ce48","page":"events","tab":"layout","label":"Display Address","description":"Specify if the address should be displayed.","keywords":"display address specify the address should displayed"},{"id":"901823a8171fa570","page":"events","tab":"layout","label":"Display Remaining Seats","description":"Specify if the number of seats left should be displayed.","keywords":"display remaining seats specify the number seats left should displayed"},{"id":"6995b734e09346a4","page":"events","tab":"layout","label":"Display Description in Listings","description":"Specify if the description in listings should be displayed.","keywords":"display description listings specify the description listings should displayed"},{"id":"1e5cdd9e469ca783","page":"events","tab":"layout","label":"Display Description","description":"Specify if the description in details box should be displayed.","keywords":"display description specify the description details box should displayed"},{"id":"5d9a28a42d85ff0e","page":"general","tab":"general","label":"Enable Friends","description":"If this option is disabled, user's would not be able to access the friends features on the site.","keywords":"enable friends the this option disabled users would not able access friends"},{"id":"a3ec975e9e41fa37","page":"general","tab":"general","label":"Enable Friend Invitation","description":"Allow users on the site to invite other users to join the site.","keywords":"enable friend invitation users the site allow invite other join"},{"id":"228701dd9169da6b","page":"general","tab":"general","label":"Enable Followers","description":"If this option is enabled, users on the site would be able to follow other users on the site.","keywords":"enable followers users the site this option enabled would able follow other"},{"id":"e0b975609aa027e6","page":"general","tab":"general","label":"Enable Privacy","description":"This option determines if privacy should be enabled on the site. When this option is switched off, privacy will be ignored altogether","keywords":"enable privacy this option privacy determines should enabled the site when switched"},{"id":"49dea79fe4ea2d08","page":"general","tab":"general","label":"Enable Points","description":"By enabling this option, user's on the site would be able to achieve points on the site and their friend's would also be able to view their achievements.","keywords":"enable points the site would able their enabling this option users achieve"},{"id":"51b3e0002f4ef285","page":"general","tab":"general","label":"Enable Activity Logs","description":"This option determines if activity logs should be enabled. Activity logs is the area where users manage their hidden and active activities","keywords":"enable activity logs activity logs this users active and hidden their manage area"},{"id":"bd018980140d8c43","page":"general","tab":"general","label":"Enable Polls","description":"By enabling this option, user's on the site would be able to create polls on the site.","keywords":"enable polls the site enabling this option users would able create polls"},{"id":"0e9dc7a2eef77d7f","page":"general","tab":"general","label":"Enable Achievements","description":"If this option is disabled, user's would not be able to achieve badges on the site.","keywords":"enable achievements this option disabled users would not able achieve badges the"},{"id":"46c3128eb2f9405c","page":"general","tab":"general","label":"Enable Advertisements","description":"If this option is enabled, admin's would be able to create advertisement stream on the site.","keywords":"enable advertisements this option enabled admins would able create advertisement stream the"},{"id":"4bd63e1d249b5556","page":"general","tab":"general","label":"Advert Stream Display","description":"Select the frequency in which adverts should display on the stream.","keywords":"advert stream display the select frequency which adverts should display stream"},{"id":"0c59cc2cc78aa800","page":"general","tab":"general","label":"Enable Applications","description":"Determines if the user is allowed to browse for applications on the site.","keywords":"enable applications the determines user allowed browse for applications site"},{"id":"b07dd81710068d8a","page":"general","tab":"general","label":"Show T&C when Installing App","description":"This option determines if the terms and conditions should be displayed when installing the app","keywords":"show when installing app the this option determines terms and conditions should displayed when"},{"id":"7846fe1c5d4c59ec","page":"general","tab":"general","label":"Terms & Condition Message","description":"This would be the terms and conditions that the user see before they install the app.","keywords":"terms condition message the this would terms and conditions that user see before"},{"id":"694796eb80997b2a","page":"general","tab":"general","label":"Display Welcome Message","description":"When this option is enabled, a welcome message will be displayed to users. This message will be hidden automatically when the user closes the message","keywords":"display welcome message message when this will the option enabled welcome displayed users"},{"id":"e99f2d81c3d24f8d","page":"general","tab":"general","label":"Welcome Message","description":"This is the message that would appear to users when they login to the site","keywords":"welcome message the this message that would appear users when they login"},{"id":"d64f20726bf3b19e","page":"general","tab":"general","label":"Enforce Minimum Characters for Search","description":"This option determines if minimum number of characters is required before performing a search","keywords":"enforce minimum characters for search this option determines minimum number characters required before performing search"},{"id":"21a51ce7fd701104","page":"general","tab":"general","label":"Minimum Characters before Searching","description":"This option determines the number of characters required for the search query","keywords":"minimum characters before searching the this option determines number characters required for search query"},{"id":"66d820c746548409","page":"general","tab":"general","label":"Enable Keywords Suggestion In Toolbar Search","description":"If enabled, toolbar search will show keywords suggestion first before perform the actual search. This is useful to further filter the search items that user are currently seaching.","keywords":"enable keywords suggestion toolbar search search the enabled useful currently are user that items filter"},{"id":"7e7a53b60368e2d5","page":"general","tab":"general","label":"Enable Giphy","description":"Determine if the Giphy feature should be enabled","keywords":"enable giphy determine the giphy feature should enabled"},{"id":"d876ff8da67c3731","page":"general","tab":"general","label":"API Key","description":"Insert the Giphy API Key that you have received from Giphy. If you have not created the app yet, you need to create the app at https:\/\/developers.giphy.com first in order to obtain the API Key","keywords":"api key the you giphy api key have app insert need order"},{"id":"8d0f3fc75fdd8fe5","page":"general","tab":"general","label":"Total GIFs to Display in Selection","description":"This option determines the total number of GIF images to be rendered in the GIF selection","keywords":"total gifs display selection gif the this option determines total number images rendered selection"},{"id":"00995287f81bd92a","page":"general","tab":"general","label":"Enable Lockdown","description":"By enabling lockdown mode, only users with an account will be allowed to access the system.","keywords":"enable lockdown enabling lockdown mode only users with account will allowed access"},{"id":"f8703cce04c81aa1","page":"general","tab":"general","label":"Allow Registrations During Lockdown","description":"When this option is enabled, users will still be able to access the registration area.","keywords":"allow registrations during lockdown when this option enabled users will still able access the"},{"id":"6b2ce8631ddcdcf6","page":"general","tab":"general","label":"Enable Social Sharing","description":"Set if Social Sharing should be enabled globally on the site.","keywords":"enable social sharing set social sharing should enabled globally the site"},{"id":"8100f2685df6b85f","page":"general","tab":"general","label":"Enable Email Sharing","description":"This will enable sharing links through email.","keywords":"enable email sharing this will enable sharing links through email"},{"id":"4067ebc1e7b5773d","page":"general","tab":"general","label":"Limit Number Of Emails Every Hour","description":"Set the amount of share that a user can send through email per hour.","keywords":"limit number emails every hour set the amount share that user can send through email"},{"id":"cc9adcd682704ee3","page":"general","tab":"general","label":"Enable Reporting","description":"If this is enabled, reporting is enabled throughout the site. If disabled, reporting would not appear on the site.","keywords":"enable reporting enabled reporting the site this throughout disabled would not appear"},{"id":"b83b3567677704c5","page":"general","tab":"general","label":"Allow Guests To Report","description":"By enabling this option, guests would be allowed to submit reports.","keywords":"allow guests report enabling this option guests would allowed submit reports"},{"id":"f5252d376a9f9134","page":"general","tab":"general","label":"Custom E-mail Addresses","description":"Set custom email addresses that you would like the system to send notifications to when a new report is submitted.","keywords":"custom email addresses set custom email addresses that you would like the system"},{"id":"903f7db05e7e8120","page":"general","tab":"comments","label":"Allow Guests To View Comments","description":"If this is enabled, unregistered user can read comments on public stream items.","keywords":"allow guests view comments this enabled unregistered user can read comments public stream items"},{"id":"f8070ba27153eaa5","page":"general","tab":"comments","label":"Allow Smileys In Comments","description":"When this option is enabled, a smiley icon would appear along with the comment form allowing users to choose a smiley.","keywords":"allow smileys comments smiley when this option enabled icon would appear along with"},{"id":"093aeca8bbb3e692","page":"general","tab":"comments","label":"Allow Giphy In Comments","description":"Allow Giphy In Comments_DESC","keywords":"allow giphy comments allow giphy commentsdesc"},{"id":"a5edebcc9c7ab528","page":"general","tab":"comments","label":"Total Comments To Display Initially","description":"Set the pagination limit for comments.","keywords":"total comments display initially set the pagination limit for comments"},{"id":"8ec86bcc8f19b684","page":"general","tab":"comments","label":"Allow Image Attachments In Comments","description":"This option determines if the user is allowed to upload images in comments","keywords":"allow image attachments comments this option determines the user allowed upload images comments"},{"id":"e1b3a70fc0bf486b","page":"general","tab":"comments","label":"Automatically Resize Images","description":"When this option is activated, images uploaded via the comment form will be resized based on the maximum width and height set below.","keywords":"automatically resize images the when resized set height and width maximum based form"},{"id":"f70d15c0df5e9471","page":"general","tab":"comments","label":"Image Threshold Dimension (Width)","description":"Set the maximum size of images uploaded via the comment form.","keywords":"image threshold dimension width the set maximum size images uploaded via comment form"},{"id":"9bcb40210bd3c6c6","page":"general","tab":"comments","label":"Image Threshold Dimension (Height)","description":"Set the maximum height of images uploaded via the comment form.","keywords":"image threshold dimension height the set maximum height images uploaded via comment form"},{"id":"e1acb74cdd730d0a","page":"general","tab":"comments","label":"Maximum Individual File Size","description":"Set the maximum file size a user can upload through the comment attachments. Size needs to be in <strong>MB<\/strong>.","keywords":"maximum individual file size the size set maximum file user can upload through comment"},{"id":"ac44d3ec5efadf62","page":"general","tab":"conversations","label":"Enable Conversations","description":"Determines if the conversation in the site should be activated or disabled. Disabling this option will also cause the notifications for conversation to be disabled automatically.","keywords":"enable conversations the conversation disabled determines site should activated disabling this option"},{"id":"db4d41a8b41f64a4","page":"general","tab":"conversations","label":"Enter Key To Send Message","description":"When this option is activated, hitting the enter key alone would send a reply","keywords":"enter key send message when this option activated hitting the enter key alone would"},{"id":"ad62add05dcd6fc9","page":"general","tab":"conversations","label":"Allow Messaging Non Friends","description":"Determine if users allowed to compose new conversation to non friend users.","keywords":"allow messaging non friends users determine allowed compose new conversation non friend"},{"id":"00b521959123f463","page":"general","tab":"conversations","label":"Display Typing State","description":"When this option is activated, the typing state of the user will be visible on the conversation","keywords":"display typing state the when this option activated typing state user will visible"},{"id":"1b4bfc704091acc5","page":"general","tab":"conversations","label":"Enable Location Sharing","description":"If enabled, users would be able to tag their current location from where they are posting their message.","keywords":"enable location sharing their enabled users would able tag current location from where"},{"id":"8f7819043f188285","page":"general","tab":"conversations","label":"Default Conversations Sorting","description":"Determines the sorting sequence for conversations that are listed on the conversations page.","keywords":"default conversations sorting the conversations determines sorting sequence for that are listed page"},{"id":"4080142c2e382e8b","page":"general","tab":"conversations","label":"Default Conversation Ordering","description":"Determines the ordering for conversations that are listed on the conversations page.","keywords":"default conversation ordering the conversations determines ordering for that are listed page"},{"id":"27002125d57de53e","page":"general","tab":"conversations","label":"Allow File Attachments","description":"Determines if file attachments are allowed in a conversation.","keywords":"allow file attachments determines file attachments are allowed conversation"},{"id":"099aaf46fa32549a","page":"general","tab":"conversations","label":"Allowed File Types","description":"Determines what file types are supported on the system.","keywords":"allowed file types determines what file types are supported the system"},{"id":"e1acb74cdd730d0a","page":"general","tab":"conversations","label":"Maximum Individual File Size","description":"Set the maximum file size a user can upload through the conversation attachments. Size needs to be in <strong>MB<\/strong>.","keywords":"maximum individual file size the size set maximum file user can upload through conversation"},{"id":"de93558effe34037","page":"general","tab":"links","label":"Cache Links","description":"Cache the URLs data to reduce the parsing rate when the same URL is shared on the site.","keywords":"cache links the cache urls data reduce parsing rate when same url"},{"id":"e412bd0421ffd255","page":"general","tab":"links","label":"Cache Images","description":"When user shares a link on the page, images are still referenced back to the original site. If the image is missing, it would cause the page to not load correctly.","keywords":"cache images the page when site load not cause would missing image"},{"id":"ed17f1ffff2ca3c1","page":"general","tab":"links","label":"Automatically Purge Cached Urls","description":"By enabling this feature, the URLs would automatically be purged whenever the cronjob is executed.","keywords":"automatically purge cached urls the enabling this feature urls would automatically purged whenever cronjob"},{"id":"099beec8172c1972","page":"general","tab":"links","label":"Purging Interval","description":"Specify the number of months before the URLs expired","keywords":"purging interval the specify number months before urls expired"},{"id":"81c5a9520dc7de38","page":"general","tab":"links","label":"Validate URLs Before Parsing","description":"When the user types a URL in the story form's text area, the system will check and see if the url is valid before adding and parsing it in the link form.","keywords":"validate urls before parsing the url and when link parsing adding before valid see"},{"id":"97de3d8a702a8826","page":"general","tab":"links","label":"Supported Top Level Domains","description":"You will be able to define the supported top level domains that should be detected as a hyperlink","keywords":"supported top level domains you will able define the supported top level domains that"},{"id":"508a05a7ef147a62","page":"general","tab":"location","label":"Service Provider","description":"Specify the location service integration to use.","keywords":"service provider specify the location service integration use"},{"id":"a03d4a6e5749e385","page":"general","tab":"location","label":"Proximity Search Unit","description":"Choose the unit used in location proximity search.","keywords":"proximity search unit choose the unit used location proximity search"},{"id":"a609e26bed68c33f","page":"general","tab":"location","label":"Use Restricted API Key","description":"Determine if system should use restricted api key that you have set from google console.","keywords":"use restricted api key determine system should use restricted api key that you have"},{"id":"d876ff8da67c3731","page":"general","tab":"location","label":"API Key","description":"Set your Google Maps API Key here.","keywords":"api key set your google maps api key here"},{"id":"cc347e6d84b1b858","page":"general","tab":"location","label":"Browser Key","description":"Set your browser key here. The key is also known as Referrer Restriction key.","keywords":"browser key key set your browser here the also known referrer restriction"},{"id":"c1516c965c7e0cc2","page":"general","tab":"location","label":"Server Key","description":"Set your server key here. The key is also known as IP Address Restriction key.","keywords":"server key key set your server here the also known address restriction"},{"id":"76525f0f34b48475","page":"general","tab":"location","label":"Client ID","description":"Set your Foursquare Client ID here.","keywords":"client set your foursquare client here"},{"id":"734082edf44417dd","page":"general","tab":"location","label":"Client Secret","description":"Set your Foursquare Client Secret here.","keywords":"client secret set your foursquare client secret here"},{"id":"d876ff8da67c3731","page":"general","tab":"location","label":"API Key","description":"Set your Google Places API Key here.","keywords":"api key set your google places api key here"},{"id":"e6ee722cc96a2f01","page":"general","tab":"notifications","label":"Enable E-mail Notifications","description":"This option determines if e-mail notifications should be enabled for EasySocial. When this option is disabled, no e-mail notifications will be generated from the site","keywords":"enable email notifications this option email notifications determines should enabled for easysocial when"},{"id":"59d669b8fae08eda","page":"general","tab":"notifications","label":"Enable New System Notifications","description":"By turning this option on, system notifications will be enabled on the site. It automatically polls for new system activity and alerts the user with a notification counter.","keywords":"enable new system notifications system the turning new notification with user alerts and activity"},{"id":"8a5f9bf24236d891","page":"general","tab":"notifications","label":"Automatically Mark System Alert Items As Read","description":"This option determines if the system should mark items as read when the system notifications is opened","keywords":"automatically mark system alert items read the system this option determines should mark items read when"},{"id":"7259fff6ec42b2c1","page":"general","tab":"notifications","label":"Enable New Friend Notifications","description":"By turning this option on, the system will display a friend request counter by polling the server at the specified interval","keywords":"enable new friend notifications the turning this option system will display friend request counter"},{"id":"b2be876f15143bb0","page":"general","tab":"notifications","label":"Enable New Conversation Notifications","description":"By turning this option on, the system will poll the server for new conversations and display a counter when there are new conversations.","keywords":"enable new conversation notifications new the conversations turning there when counter display and for"},{"id":"ab56f47e8accd4d5","page":"general","tab":"notifications","label":"Automatically Mark Conversations As Read","description":"When this option is enabled, all conversations are marked as read automatically upon opening the conversations popup","keywords":"automatically mark conversations read conversations when this option enabled all are marked read automatically"},{"id":"80c8bc261992e1b0","page":"general","tab":"notifications","label":"Polling Interval","description":"The shorter the polling interval is, the faster the user gets updates on the screen. If your hosting provider restricts the number of processes that can run, you would need to increase this value","keywords":"polling interval the number this increase need would you run can that"},{"id":"cd483640ef82207b","page":"general","tab":"notifications","label":"Enable Admin Broadcasting","description":"If this option is enabled, users would receive a notification bubble when a new broadcast is posted by the site admin.","keywords":"enable admin broadcasting this option enabled users would receive notification bubble when new"},{"id":"888a35707e692f9f","page":"general","tab":"notifications","label":"Sticky Popup","description":"If this option is enabled, the popup would be sticky. Users would need to close the popup manually instead.","keywords":"sticky popup the popup would this option enabled sticky users need close"},{"id":"f1acab0f6d46a803","page":"general","tab":"notifications","label":"Broadcast Period","description":"Specify the time for the broadcast popup to last.","keywords":"broadcast period the specify time for broadcast popup last"},{"id":"37dfaf2822f35e09","page":"general","tab":"notifications","label":"Enable Automated Cleanup","description":"This option determines if automated cleanup should be enabled. When enabled, EasySocial will remove notification items when the cronjob executes.","keywords":"enable automated cleanup enabled when this option determines automated cleanup should easysocial will"},{"id":"a0219ca35ba6d1a2","page":"general","tab":"notifications","label":"Cleanup Notifications Older Than","description":"Clean up the notification item if the notification creation date is more than specified number of months.","keywords":"cleanup notifications older than the notification clean item creation date more than specified number"},{"id":"feb319db1a270a56","page":"general","tab":"seo","label":"Allow Duplicate Title For Clusters","description":"Determine if duplicate title should be allowed for groups, pages and events created on the site. If this option is disabled, clusters that have the same title will have additional incremental id at the end of the title.","keywords":"allow duplicate title for clusters the title have determine option incremental additional will same that"},{"id":"f9a0dac5f776a20c","page":"general","tab":"seo","label":"SEF Urls To Use IDs","description":"When disabled, system will remove ID segment from SEF urls.","keywords":"sef urls use ids when disabled system will remove segment from sef urls"},{"id":"664ef010ec0a7fa5","page":"general","tab":"seo","label":"User's Media SEF Format","description":"Determine the user's  media (Albums, Videos and Audios) the SEF urls format whether to use default format or the new format where the url include user-alias and media-type segments.","keywords":"users media sef format the format and determine default mediatype useralias include url where"},{"id":"c2493fb4960d0479","page":"general","tab":"seo","label":"Enable SEF Cache File","description":"Determine if system should read the sef cache from a file or not. If disabled, system will retrieve the sef cache directly from the database.","keywords":"enable sef cache file the system sef cache from determine should read file not"},{"id":"9acd2301dbcfd015","page":"general","tab":"system","label":"Use index.php For Ajax URL","description":"If your site has a redirection from \/index.php to \/, you will need to ensure that this option is disabled","keywords":"use indexphp for ajax url your site has redirection from indexphp you will need ensure"},{"id":"2bd019879c468e87","page":"general","tab":"system","label":"Load Internal jQuery Library","description":"This option determines if EasySocial should render it's own jQuery library on the site. If your site already has jQuery and do not want to render multiple jQuery copies, you can disable this option.","keywords":"load internal jquery library jquery this render option site should and can you copies"},{"id":"47de292f45b9ce78","page":"general","tab":"system","label":"Enable 404 Error Redirection","description":"By enabling this, user will be redirected to EasySocial frontpage instead of error 404 page. However this will only apply to certain area as there are special case where EasySocial will still need to use error 404 handler to sustain the system.","keywords":"enable error redirection will easysocial error this enabling are the sustain handler use"},{"id":"3393a1f38669e4fd","page":"general","tab":"system","label":"CDN Url","description":"Url to the CDN host, e.g. http:\/\/cdn123.maxcdn.net <br ><\/i><br \/>To disable CDN, simply remove the url and save your settings.","keywords":"cdn url url the cdn host httpcdn123maxcdnnet <br ><i><br >to disable simply"},{"id":"baf5169b251e48c6","page":"general","tab":"system","label":"Use Secure Cronjob URL","description":"By enabling this, not everyone is allowed to access the cronjob url. You will need to enter the cron key below.","keywords":"use secure cronjob url the enabling this not everyone allowed access cronjob url you"},{"id":"0be0c95e0f03b079","page":"general","tab":"system","label":"Secure Cronjob Key","description":"Set any key that will be used when accessing the cronjob. Only visitors with this will be allowed to execute the cronjob.","keywords":"secure cronjob key the will cronjob set any key that used when accessing"},{"id":"2e974faaa186d392","page":"general","tab":"system","label":"Send E-mails On Page Load","description":"This settings should be turned off by default. When enabled, emails will be processed whenever a user accesses the page. It is not recommended to turn this option on unless you do not have access to cron jobs.","keywords":"send emails page load not this the cron access have you unless option turn"},{"id":"0b4666e196a371eb","page":"general","tab":"system","label":"Process how many emails at a time","description":" Specify the number of emails to be processed every time the cron is executed","keywords":"process how many emails time the specify number emails processed every time cron executed"},{"id":"7839c307f164bbf0","page":"users","tab":"general","label":"User's Name Format","description":"Set the display name format to use for your users.","keywords":"users name format set the display name format use for your users"},{"id":"3d57f0c19e59c9b1","page":"users","tab":"general","label":"User Permalink Format","description":"Set the desired display name to be used as the user's permalink. If the user set their own permalink, this will be ommited.","keywords":"user permalink format the set permalink desired display name used users user their"},{"id":"77b1f57f0c52ad41","page":"users","tab":"general","label":"Account Deletion Behavior","description":"Set the behaviour of the account deletion when user decides to delete their account","keywords":"account deletion behavior the account set behaviour deletion when user decides delete their"},{"id":"1d6d79fb3a48fb79","page":"users","tab":"general","label":"Default Sorting In Users Listing","description":"This option determines the default sorting option for the user's listing.","keywords":"default sorting users listing option the this determines default sorting for users listing"},{"id":"a1f56b7faf74e4a8","page":"users","tab":"general","label":"Display User Count in Profiles Filter In User Listing","description":"If enabled, System show user counts in profiles filter. However, it might affect page load speed if the site's has a very huge users base.","keywords":"user display count profiles filter listing enabled load users huge very has sites the speed page"},{"id":"9e84e7625b5929d2","page":"users","tab":"general","label":"Display Online Status","description":"This option determines if user's online status should be visible on the site.","keywords":"display online status this option determines users online status should visible the site"},{"id":"045b8c195b827a4d","page":"users","tab":"general","label":"Include Site Administrators In Leaderboard","description":"If this option is disabled, site administrator's would not be included in the leaderboard.","keywords":"include site administrators leaderboard this option disabled site administrators would not included the leaderboard"},{"id":"7216a3bdbcea641d","page":"users","tab":"general","label":"Include Site Administrators In Users Listing","description":"If this option is disabled, site administrator's would not be included in the user's listings.","keywords":"include site administrators users listing this option disabled site administrators would not included the users"},{"id":"4ed30b5622b2caa6","page":"users","tab":"general","label":"Automatically Follow Friend","description":"When this option is activated, both user's will automatically follow each other after they both become friends","keywords":"automatically follow friend both when this option activated users will automatically follow each"},{"id":"b05b661331e40a8c","page":"users","tab":"general","label":"Allow User To Block Other Users","description":"When this option is enabled, users are allowed to block other users on the site preventing them from viewing their profile or sending them any messages.","keywords":"allow user block other users users them when preventing any sending profile their viewing from"},{"id":"3439634996ef9ca2","page":"users","tab":"general","label":"Enable Taking Picture With Webcam","description":"This determines if users able to take a photo using their webcam.","keywords":"enable taking picture with webcam this determines users able take photo using their webcam"},{"id":"0b413f9b63670ae8","page":"users","tab":"general","label":"Allow User's Info Download","description":"When this option is enabled, users are allowed to send a download request of their informations from the site.","keywords":"allow users info download when this option enabled users are allowed send download request"},{"id":"0634cc863e860950","page":"users","tab":"general","label":"Download Archive Expiry","description":"Specify how many days after the processed download archive should be deleted from the site.","keywords":"download archive expiry the specify how many days after processed download archive should"},{"id":"16732e7402715adc","page":"users","tab":"general","label":"Enable Page Inactivity Notice","description":"When this option is enabled, system will show a popup dialog if user inactive for more than X minutes.","keywords":"enable page inactivity notice when this option enabled system will show popup dialog user"},{"id":"d56fc325af952175","page":"users","tab":"general","label":"Page Inactivity Duration","description":"Specify after how many minutes of user inactivity should the system display the notice dialog. Please specify in minutes.","keywords":"page inactivity duration specify minutes the after how many user inactivity should system"},{"id":"2de5c4bb859bbfa0","page":"users","tab":"general","label":"Enable Verified Accounts","description":"When this option is activated, EasySocial will render a blue badge to user accounts that are verified","keywords":"enable verified accounts when this option activated easysocial will render blue badge user"},{"id":"acd08c9a9a528fa8","page":"users","tab":"general","label":"Allow User To Request For Verification","description":"This option determines if users are allowed to submit their requests for account verification","keywords":"allow user request for verification this option determines users are allowed submit their requests for"},{"id":"51eb143c491dceca","page":"users","tab":"general","label":"Profile Edit Behavior","description":"To specify user's profile editing behavior. <br ><\/i><b>Default:<\/b> The default behavior. Profile's custom fields will be saved once you've completed all the steps in the profile. <br \/><br \/><b>Step by step:<\/b> Profile's custom fields will be saved when you go to next step \/ page during profile editing. Choose this when your profile type have many steps. This method will improve the page load speed by loading custom fields per step.","keywords":"profile edit behavior profile the custom will fields step this when steps page"},{"id":"b7795c169c8e013b","page":"users","tab":"general","label":"Profile Completion Checks","description":"Enable this for system to check if the user's profile is complete according to the requirements set in profile fields.","keywords":"profile completion checks the profile enable this for system check users complete according"},{"id":"391aa90ec488d726","page":"users","tab":"general","label":"Check Optional Fields","description":"Specify if optional field should be included in the profile completion checking.","keywords":"check optional fields specify optional field should included the profile completion checking"},{"id":"922e840fb4d8a161","page":"users","tab":"general","label":"Action On Incomplete Profile","description":"Specify the action to take when the user have not completed their profile.","keywords":"action incomplete profile the specify action take when user have not completed their"},{"id":"27753133ffc53ae9","page":"users","tab":"general","label":"Named Based Pictures For Users Without Picture","description":"When this option is activated, EasySocial will use the user's first and last name as the default profile picture if the user does not have any profile picture","keywords":"named based pictures for users without picture the picture profile when name have not does user default"},{"id":"9f58e39dd450d241","page":"users","tab":"general","label":"Background Colours","description":"This option determines the background colours used in the name based avatars. You can enter as many colors as you want as it would be randomized","keywords":"background colours you the this would want colors many enter can avatars"},{"id":"440667228d2b4f1e","page":"users","tab":"general","label":"Font Colour","description":"This determines the font colour used in text based avatars","keywords":"font colour this determines the font colour used text based avatars"},{"id":"602ef5cb33261439","page":"users","tab":"general","label":"Send Reminder For Inactive Users","description":"Determine where system should send reminder for inactive users or not.","keywords":"send reminder for inactive users determine where system should send reminder for inactive users not"},{"id":"94a34864690c1fb5","page":"users","tab":"general","label":"Inactive Duration","description":"Specify the inactivity period for users that needs to receive a reminder","keywords":"inactive duration specify the inactivity period for users that needs receive reminder"},{"id":"857c7f3234dbfdf7","page":"users","tab":"general","label":"Sorting For Advanced Search","description":"Set the default sorting for advanced search","keywords":"sorting for advanced search set the default sorting for advanced search"},{"id":"85dd47b7b9f8076a","page":"users","tab":"general","label":"Indexing Format For User's Name","description":"Determine the user's name format to be indexed for the search.","keywords":"indexing format for users name the determine users name format indexed for search"},{"id":"eb40ed81fa262187","page":"users","tab":"general","label":"Index Email","description":"If enable, the indexer will index user's email and your users will be able to search someone using email.","keywords":"index email will users email enable the indexer index and your able"},{"id":"0eb28c65ad4916a7","page":"users","tab":"general","label":"Respect User's Privacy","description":"If enable, system will perform the 'profile view' privacy checking on the search results.","keywords":"respect users privacy the enable system will perform profile view privacy checking search"},{"id":"4cb3e6eac3129433","page":"users","tab":"general","label":"Allow Joomla Group Switch","description":"If enabled, EasySocial will attempt to switch user's joomla groups as well when perform profile type switching at frontend.","keywords":"allow joomla group switch enabled easysocial will attempt switch users joomla groups well when"},{"id":"36fd8a4d64082b81","page":"users","tab":"general","label":"Allow Privacy Based On Custom Fields","description":"If enabled, admin can configure the custom fields usage on privacy rules that are supporting custom fields. This also allow site members to select custom privacy based on custom field's value.","keywords":"allow privacy based custom fields custom fields privacy enabled this based select members site allow"},{"id":"e3f14c52921ca13b","page":"users","tab":"authentication","label":"Allow Logging In With E-mail","description":"By enabling this option, users would be able to login using their email address.","keywords":"allow logging with email enabling this option users would able login using their email"},{"id":"87c0dce05941c48f","page":"users","tab":"authentication","label":"Use Email as Username","description":"If enabled, the username field during registration will be hidden and users will use Email as their login id.","keywords":"use email username will enabled the username field during registration hidden and users"},{"id":"62d3a08cfc040bae","page":"users","tab":"authentication","label":"Login Redirection","description":"Specify the login redirection of users when login to the site. If your site is a multi-lingual, please choose <strong>Stay on the same page<\/strong>.","keywords":"login redirection the login site specify redirection users when your multilingual please"},{"id":"e4674c6dd70bc170","page":"users","tab":"authentication","label":"Logout Redirection","description":"Set where should the user be redirected to upon logging out from EasySocial.","keywords":"logout redirection set where should the user redirected upon logging out from"},{"id":"c2bd371f7fad763e","page":"users","tab":"authentication","label":"Enable Two Factor Authentication","description":"When this option is enabled, 2 factor authentication would be used enforced for logins.","keywords":"enable two factor authentication when this option enabled factor authentication would used enforced for"},{"id":"f4b8fa69631712db","page":"users","tab":"dashboard","label":"Dashboard Default Start Item","description":"This option determines the start item that should be displayed to the user upon accessing their dashboard.","keywords":"dashboard default start item the this option determines start item that should displayed user"},{"id":"e07e821b55f18406","page":"users","tab":"dashboard","label":"Display Everyone Filter","description":"Determines if the Everyone filter should be visible by the user.","keywords":"display everyone filter the determines everyone filter should visible user"},{"id":"33a0f4e262a160b4","page":"users","tab":"dashboard","label":"Display Custom Filters","description":"If enabled, the custom filter will be visible to user in dashboard page.","keywords":"display custom filters enabled the custom filter will visible user dashboard page"},{"id":"9e3fa6be02b727d5","page":"users","tab":"dashboard","label":"Display Activity Stream for Guests","description":"Determines if the stream and contents on the dashboard area should be visible by guests","keywords":"display activity stream for guests the determines stream and contents dashboard area should visible guests"},{"id":"02d8f33495a7e2b3","page":"users","tab":"profile","label":"Default Avatar","description":"Upload a custom default avatar","keywords":"default avatar upload custom default avatar"},{"id":"f63968ca35f43af3","page":"users","tab":"profile","label":"Default Cover","description":"Upload a custom default cover","keywords":"default cover upload custom default cover"},{"id":"2462d8d8d9417197","page":"users","tab":"profile","label":"Profile Default Start Item","description":"Specify the default display for user profile.","keywords":"profile default start item specify the default display for user profile"},{"id":"297829d5c84ccf7a","page":"users","tab":"profile","label":"Profile Sidebar","description":"Determines the position of the sidebar on the profile. It can also be switched off altogether","keywords":"profile sidebar the determines position sidebar profile can also switched off altogether"},{"id":"f285f67b0f248ab1","page":"users","tab":"profile","label":"Display Profile Cover","description":"If enabled, user's profile cover will be displayed in their profile.","keywords":"display profile cover profile enabled users cover will displayed their"},{"id":"673fed774dd81f6a","page":"users","tab":"profile","label":"Display Profile Type","description":"If this option is enabled, the user's profile type will appear on the header.","keywords":"display profile type the this option enabled users profile type will appear header"},{"id":"0b24747d9348981e","page":"users","tab":"profile","label":"Display Last Online","description":"If this option is enabled, the user's last online information will appear on the header.","keywords":"display last online the this option enabled users last online information will appear"},{"id":"edd0c665123a6c20","page":"users","tab":"profile","label":"Display Badges","description":"If enabled, user's badges will be displayed in their profile.","keywords":"display badges enabled users badges will displayed their profile"},{"id":"079fc8424cbb50e7","page":"users","tab":"profile","label":"Display Age","description":"If enabled, user's age will be displayed in their profile.","keywords":"display age enabled users age will displayed their profile"},{"id":"078043fcf890ce48","page":"users","tab":"profile","label":"Display Address","description":"If enabled, user's address will be displayed in their profile.","keywords":"display address enabled users address will displayed their profile"},{"id":"962fcada399693ab","page":"users","tab":"profile","label":"Display Gender","description":"If enabled, user's gender will be displayed in their profile.","keywords":"display gender enabled users gender will displayed their profile"},{"id":"30c6b59986e570e1","page":"users","tab":"profile","label":"Display Points Earned","description":"If enabled, user's points will be displayed in their profile.","keywords":"display points earned enabled users points will displayed their profile"},{"id":"244bb6b00a5a9330","page":"users","tab":"profile","label":"Display Joined Date","description":"If enabled, user's joined date will be displayed in their profile.","keywords":"display joined date enabled users joined date will displayed their profile"},{"id":"d809c8d5c5525324","page":"users","tab":"profile","label":"Display Apps Browse Link","description":"This option determines if the browse app link should be visible by users","keywords":"display apps browse link this option determines the browse app link should visible users"},{"id":"80da43e660bd62cf","page":"users","tab":"profile","label":"Display Applications On Sidebar","description":"This option determines if the apps should be displayed on the profile's sidebar","keywords":"display applications sidebar the this option determines apps should displayed profiles sidebar"},{"id":"76ff682c0078ef47","page":"users","tab":"registration","label":"Allow New User Registrations","description":"If enabled, visitors are allowed to register on the site.","keywords":"allow new user registrations enabled visitors are allowed register the site"},{"id":"975faff5fa845c27","page":"users","tab":"registration","label":"Display Quick Registration","description":"If this option is enabled, the mini registration form would appear beside the login form. If disabled, a simple register button would be displayed instead.","keywords":"display quick registration form the would this disabled displayed button register simple appear"},{"id":"fcf96bcb8cf7380d","page":"users","tab":"registration","label":"Quick Registration Mode","description":"Select a mode for the mini registration to point to. If quick is selected, the user will be created directly. If full is selected, then the user will be pointed to the full registration page to proceed.","keywords":"quick registration mode the user will registration full selected page pointed then directly"},{"id":"462c33733f3168d2","page":"users","tab":"registration","label":"Default Profile For Quick Registrations","description":"Choose a profile to render the mini registration form. Choose default profile to render the form based on the current selected default profile, and allow user to choose profile of their choice.","keywords":"default profile for quick registrations profile choose the render form default mini registration based current"},{"id":"0cd8a30cac3caf1c","page":"users","tab":"registration","label":"Display Clear Text Password In Email","description":"By default, Joomla displays the clear text password for the user in the email. You may choose to turn this option off here. If this option is disabled, the password will not be displayed in the registration confirmation email.","keywords":"display clear text password email the this password email option default registration displayed not will"},{"id":"7240944e5a4ced9e","page":"users","tab":"registration","label":"Profile Types Selection Layout","description":"Determine the layout between dropdown or list layout when choosing profile types during registration","keywords":"profile types selection layout layout determine the between dropdown list when choosing profile types"},{"id":"87d4585ac8ee2126","page":"users","tab":"registration","label":"Display Profile Types Avatar","description":"Determines if the profile avatar should be visible or not.","keywords":"display profile types avatar determines the profile avatar should visible not"},{"id":"1bd3cbdec485882b","page":"users","tab":"registration","label":"Display Registered Users","description":"Determines if users that are registered in that profile should be visible or not. This only applied on normal List layout for profile types selection.","keywords":"display registered users that profile determines applied types for layout list normal this"},{"id":"feb0b0df31e716cb","page":"users","tab":"registration","label":"Display Reconfirm E-mail","description":"When this option is enabled, the reconfirm e-mail address will be visible when user's sign-up or edit their profile","keywords":"display reconfirm email when this option enabled the reconfirm email address will visible"},{"id":"be635cf29c1051ca","page":"groups","tab":"general","label":"Enable Groups","description":"By disabling this option, user's would not be able to access the group features in EasySocial.","keywords":"enable groups disabling this option users would not able access the group"},{"id":"6f012c5addf44aac","page":"groups","tab":"general","label":"Allow Inviting Non Friends","description":"This option determines if users are allowed to invite other users who are not their friends","keywords":"allow inviting non friends users are this option determines allowed invite other who not"},{"id":"b8773a136a22a008","page":"groups","tab":"general","label":"Explicitly Display Site Admin’s Story Posting","description":"If enabled, story posting from site admins will appear in cluster page.","keywords":"explicitly display site admins story posting enabled story posting from site admins will appear cluster page"},{"id":"11beb1dd294a83a3","page":"groups","tab":"general","label":"Display Social Buttons On Private & Invite Only","description":"This option determines if the social buttons should appear on private and invite only","keywords":"display social buttons private invite only this option determines the social buttons should appear private and"},{"id":"485fafad9688470a","page":"groups","tab":"general","label":"Allow Tagging Non Friends","description":"Determines whether non-friends can be tagged under comments in public groups","keywords":"allow tagging non friends determines whether nonfriends can tagged under comments public groups"},{"id":"02d8f33495a7e2b3","page":"groups","tab":"layout","label":"Default Avatar","description":"Upload a custom default avatar","keywords":"default avatar upload custom default avatar"},{"id":"f63968ca35f43af3","page":"groups","tab":"layout","label":"Default Cover","description":"Upload a custom default cover","keywords":"default cover upload custom default cover"},{"id":"9ac623980f805ec8","page":"groups","tab":"layout","label":"Default Tab","description":"Select the default tab that should be visible when the item is being accessed","keywords":"default tab the select default tab that should visible when item being"},{"id":"bcbdff2274413f0c","page":"groups","tab":"layout","label":"Default Editor For Group Descriptions","description":"Select an editor that you would like to use for the Group Descriptions.","keywords":"default editor for group descriptions select editor that you would like use for the group"},{"id":"4e3c78d297b88c96","page":"groups","tab":"layout","label":"Display Hit Counter","description":"This option will enable the hit counter from displaying under the group pages.","keywords":"display hit counter the this option will enable hit counter from displaying under"},{"id":"6564bcc87a15daa4","page":"groups","tab":"layout","label":"Display Category Headers","description":"If enabled, the category headers will appear in the group listing pages.","keywords":"display category headers the enabled category headers will appear group listing pages"},{"id":"6995b734e09346a4","page":"groups","tab":"layout","label":"Display Description in Listings","description":"Specify if the description in listings should be displayed.","keywords":"display description listings specify the description listings should displayed"},{"id":"1e5cdd9e469ca783","page":"groups","tab":"layout","label":"Display Description","description":"Specify if the description in details box should be displayed.","keywords":"display description specify the description details box should displayed"},{"id":"03bbf79d4718f05b","page":"pages","tab":"general","label":"Enable Pages","description":"By disabling this option, user's would not be able to access the page features in EasySocial.","keywords":"enable pages disabling this option users would not able access the page"},{"id":"6f012c5addf44aac","page":"pages","tab":"general","label":"Allow Inviting Non Friends","description":"This option determines if users are allowed to invite other users who are not their friends","keywords":"allow inviting non friends users are this option determines allowed invite other who not"},{"id":"b8773a136a22a008","page":"pages","tab":"general","label":"Explicitly Display Site Admin’s Story Posting","description":"If enabled, story posting from site admins will appear in cluster page.","keywords":"explicitly display site admins story posting enabled story posting from site admins will appear cluster page"},{"id":"11beb1dd294a83a3","page":"pages","tab":"general","label":"Display Social Buttons On Private & Invite Only","description":"This option determines if the social buttons should appear on private and invite only","keywords":"display social buttons private invite only this option determines the social buttons should appear private and"},{"id":"485fafad9688470a","page":"pages","tab":"general","label":"Allow Tagging Non Friends","description":"Determines whether non-friends can be tagged under comments in public pages","keywords":"allow tagging non friends determines whether nonfriends can tagged under comments public pages"},{"id":"02d8f33495a7e2b3","page":"pages","tab":"layout","label":"Default Avatar","description":"Upload a custom default avatar","keywords":"default avatar upload custom default avatar"},{"id":"f63968ca35f43af3","page":"pages","tab":"layout","label":"Default Cover","description":"Upload a custom default cover","keywords":"default cover upload custom default cover"},{"id":"9ac623980f805ec8","page":"pages","tab":"layout","label":"Default Tab","description":"Select the default tab that should be visible when the item is being accessed","keywords":"default tab the select default tab that should visible when item being"},{"id":"5cf6ff60c8db321f","page":"pages","tab":"layout","label":"Default Editor For Page Descriptions","description":"Select an editor that you would like to use for the Page Descriptions.","keywords":"default editor for page descriptions select editor that you would like use for the page"},{"id":"7c7e5ab02191b319","page":"pages","tab":"layout","label":"Display Hits","description":"This option will enable the hit counter from displaying under the page pages.","keywords":"display hits the this option will enable hit counter from displaying under"},{"id":"6564bcc87a15daa4","page":"pages","tab":"layout","label":"Display Category Headers","description":"If enabled, the category headers will appear in the page listing pages.","keywords":"display category headers the enabled category headers will appear page listing pages"},{"id":"6995b734e09346a4","page":"pages","tab":"layout","label":"Display Description in Listings","description":"Specify if the description in listings should be displayed.","keywords":"display description listings specify the description listings should displayed"},{"id":"1e5cdd9e469ca783","page":"pages","tab":"layout","label":"Display Description","description":"Specify if the description in details box should be displayed.","keywords":"display description specify the description details box should displayed"},{"id":"c2b44f0c411bf9a0","page":"audios","tab":"general","label":"Enable Audio","description":"This option determines if audio should be enabled on the site","keywords":"enable audio this option determines audio should enabled the site"},{"id":"3f755f5ed360a6aa","page":"audios","tab":"general","label":"Enable Audio Uploads","description":"This option determines if users are allowed to utilize the audio uploads functionality.","keywords":"enable audio uploads this option determines users are allowed utilize the audio uploads"},{"id":"90cbbeb91f454ca1","page":"audios","tab":"general","label":"Enable Audio Encoder","description":"This option determines if the audio should be encoded or directly store the uploaded file.","keywords":"enable audio encoder the this option determines audio should encoded directly store uploaded"},{"id":"b80cd5ffebbc5ed7","page":"audios","tab":"general","label":"Enable External Audio Embeds","description":"This option determines if audio embedding should be enabled on the site.","keywords":"enable external audio embeds this option determines audio embedding should enabled the site"},{"id":"ee5c12be1a0c5581","page":"audios","tab":"general","label":"Allow Spotify Embed","description":"This option determines if Spotify embedding should be allowed on the site.","keywords":"allow spotify embed this option determines spotify embedding should allowed the site"},{"id":"2b0ca159eb75e6c0","page":"audios","tab":"general","label":"Allow Soundcloud Embed","description":"This option determines if Soundcloud embedding should be allowed on the site.","keywords":"allow soundcloud embed this option determines soundcloud embedding should allowed the site"},{"id":"55803ff95a0acfee","page":"audios","tab":"general","label":"Allow Downloading Audio","description":"If this option is enabled, users will able to download audio.","keywords":"allow downloading audio this option enabled users will able download audio"},{"id":"ae38bd31cb1e29f9","page":"audios","tab":"general","label":"Path to Encoder","description":"If audio uploads are enabled, audio encoder is required in order for the system to transcode uploaded audio.","keywords":"path encoder audio uploads are enabled encoder required order for the system"},{"id":"882e55f43b8b3cc8","page":"audios","tab":"general","label":"Delete Processed Audio","description":"If this option is enabled, the original audio would be deleted after the audio is encoded.","keywords":"delete processed audio the audio this option enabled original would deleted after encoded"},{"id":"001c0551e6df97b6","page":"audios","tab":"general","label":"Encode Audio Immediately After Upload","description":"This option determines if the audio should be encoded as soon as the user uploads the audio.","keywords":"encode audio immediately after upload the audio this option determines should encoded soon user uploads"},{"id":"7397437dddb5b8ea","page":"audios","tab":"general","label":"Import Audio Metadata","description":"This option determines if the metadata should be imported as soon as the user uploads the audio.","keywords":"import audio metadata the this option determines metadata should imported soon user uploads"},{"id":"05c4389f11e849aa","page":"audios","tab":"general","label":"Maximum Audio Bitrate","description":"Setting a higher bitrate would produce better audio quality but it would also take up more disk space.","keywords":"maximum audio bitrate would setting higher bitrate produce better audio quality but also"},{"id":"d923e63fb69e749c","page":"audios","tab":"layout","label":"Display Other Audio From Genre","description":"When this option is enabled, EasySocial will display a list of recent audio beneath the main audio item.","keywords":"display other audio from genre audio when this option enabled easysocial will display list recent"},{"id":"fc13e2ec4a9134fa","page":"audios","tab":"layout","label":"Total Audio To Display","description":"Determines the total number of audio to be displayed on the item page.","keywords":"total audio display the determines total number audio displayed item page"},{"id":"7c7e5ab02191b319","page":"audios","tab":"layout","label":"Display Hits","description":"Determines if the hit counter should be visible on the item view","keywords":"display hits the determines hit counter should visible item view"},{"id":"08dd837c7c82eb13","page":"audios","tab":"layout","label":"Display Audio Duration","description":"Determines if the audio duration should be visible on the item view","keywords":"display audio duration the determines audio duration should visible item view"},{"id":"e94d0bd85b50e17e","page":"audios","tab":"layout","label":"Display People Tags","description":"Determines if the audio people tags should be visible on the item view.","keywords":"display people tags the determines audio people tags should visible item view"},{"id":"ffc576cfbb944a2c","page":"audios","tab":"layout","label":"Display Tags","description":"Determines if the audio tags should be visible on the item view","keywords":"display tags the determines audio tags should visible item view"},{"id":"b3a74feacf0b7a71","page":"social","tab":"facebook","label":"Allow Registrations","description":"If enabled, visitors are allowed to sign up on the site using their own Facebook account. This feature would increase user signups on the site.","keywords":"allow registrations site the enabled account user increase would feature this own"},{"id":"02f92d486455bcbb","page":"social","tab":"facebook","label":"Oauth Redirect URIs","description":"Copy these oauth redirect uri and set into your Facebook app <b>Valid OAuth redirect URIs<\/b> field.","keywords":"oauth redirect uris oauth redirect copy these uri and set into your facebook"},{"id":"3fd52b33a023da5c","page":"social","tab":"facebook","label":"Scopes Permission","description":"These user permissions can be allow to access those data from Facebook user account during authentication, but ensure that you have get these permission approval by Facebook reviewer before you choose.","keywords":"scopes permission these user you facebook before reviewer approval permission get have"},{"id":"a1dd82a8f8597e56","page":"social","tab":"facebook","label":"Automatically Login","description":"When this option is enabled, user's that are logged into Facebook will automatically login to the site","keywords":"automatically login when this option enabled users that are logged into facebook"},{"id":"4e780370c3e8cfd0","page":"social","tab":"facebook","label":"Automatically Link & Create Account","description":"When this option is enabled, EasySocial will not prompt users to create account or link their account. It will bypass the standard account creation process when signing in with Facebook","keywords":"automatically link create account account will when enabled bypass with signing process creation standard"},{"id":"81ee9e44098c26f1","page":"social","tab":"facebook","label":"App ID","description":"To obtain the API key, you will first need to create your application at https:\/\/developers.facebook.com","keywords":"app obtain the api key you will first need create your"},{"id":"61be046f95cb2ba0","page":"social","tab":"facebook","label":"App Secret","description":"To obtain the App Secret, you will first need to create your application at https:\/\/developers.facebook.com","keywords":"app secret obtain the app secret you will first need create your"},{"id":"0d0e14a217b7648e","page":"social","tab":"facebook","label":"Insert Opengraph Tags","description":"If this option is enabled, EasySocial will add the necessary open graph tags on pages that has these tags.","keywords":"insert opengraph tags tags this option enabled easysocial will add the necessary open"},{"id":"1f563489b07b1544","page":"social","tab":"facebook","label":"Registration Type","description":"You can configure how the registrations should behave if the user signs up with their Facebook account.","keywords":"registration type the you can configure how registrations should behave user signs"},{"id":"3ef0029f01897db2","page":"social","tab":"facebook","label":"Default Profile","description":"Select the profile type that should be used by default when a user signs up on the site with their Facebook account.","keywords":"default profile the select profile type that should used default when user"},{"id":"f6039d44b29456b2","page":"social","tab":"facebook","label":"Username","description":"Specify which data from Facebook to use as Username on the site.","keywords":"username specify which data from facebook use username the site"},{"id":"2947220e6874db01","page":"social","tab":"facebook","label":"Import Profile Picture","description":"If this option is enabled, the user's profile picture will be imported to the site.","keywords":"import profile picture the this option enabled users profile picture will imported site"},{"id":"e86fb7ad8af9517a","page":"social","tab":"facebook","label":"Import Profile Cover","description":"If this option is enabled, the user's profile cover will be imported to the site.","keywords":"import profile cover the this option enabled users profile cover will imported site"},{"id":"53668a7cef09aca0","page":"social","tab":"facebook","label":"Use JFBConnect Buttons","description":"If you would like to render social buttons from JFBConnect, turn on this option here. Do take note that once JFBConnect buttons are loaded, our own Facebook login button would be disabled.","keywords":"use jfbconnect buttons buttons jfbconnect would you that button login facebook own our"},{"id":"b3a74feacf0b7a71","page":"social","tab":"linkedin","label":"Allow Registrations","description":"This option determines if users on the site may register by using the sign in with LinkedIn button","keywords":"allow registrations the this option determines users site may register using sign"},{"id":"02f92d486455bcbb","page":"social","tab":"linkedin","label":"Oauth Redirect URIs","description":"Copy these oauth redirect uri and set into your Facebook app <b>Valid OAuth redirect URIs<\/b> field.","keywords":"oauth redirect uris oauth redirect copy these uri and set into your facebook"},{"id":"76525f0f34b48475","page":"social","tab":"linkedin","label":"Client ID","description":"Client ID can be found in your LinkedIn app settings. You will need to copy the Client ID and paste it here","keywords":"client client can found your linkedin app settings you will need"},{"id":"734082edf44417dd","page":"social","tab":"linkedin","label":"Client Secret","description":"Client Secret can be found in your LinkedIn app settings. You will need to copy the Client Secret and paste it here","keywords":"client secret client secret can found your linkedin app settings you will"},{"id":"1f563489b07b1544","page":"social","tab":"linkedin","label":"Registration Type","description":"This option determines the registration workflow for users signing on with their LinkedIn account","keywords":"registration type this option determines the registration workflow for users signing with"},{"id":"e962645619acfccd","page":"social","tab":"linkedin","label":"Default Profile Type","description":"This option will only take effect when the registration type is set to simplified","keywords":"default profile type this option will only take effect when the registration type"},{"id":"2947220e6874db01","page":"social","tab":"linkedin","label":"Import Profile Picture","description":"This option determines if the user is allowed to import their profile picture from LinkedIn","keywords":"import profile picture this option determines the user allowed import their profile picture"},{"id":"b3a74feacf0b7a71","page":"social","tab":"twitter","label":"Allow Registrations","description":"This option determines if users on the site may register by using the sign in with twitter button","keywords":"allow registrations the this option determines users site may register using sign"},{"id":"233ca28f989a0c49","page":"social","tab":"twitter","label":"Oauth Callback URLs","description":"Copy these oauth callback URLs and set into your Twitter app <b>Callback URLs<\/b> field.","keywords":"oauth callback urls copy these oauth callback urls and set into your twitter"},{"id":"ce7a078b44ca11b0","page":"social","tab":"twitter","label":"Consumer Key","description":"Consumer Key can be found in your Twitter app settings. You will need to copy the Consumer Key and paste it here","keywords":"consumer key consumer key can found your twitter app settings you will"},{"id":"2ce81aa6854aea8c","page":"social","tab":"twitter","label":"Consumer Secret","description":"Consumer Secret can be found in your Twitter app settings. You will need to copy the Consumer Secret and paste it here","keywords":"consumer secret consumer secret can found your twitter app settings you will"},{"id":"1f563489b07b1544","page":"social","tab":"twitter","label":"Registration Type","description":"This option determines the registration workflow for users signing on with their Twitter account","keywords":"registration type this option determines the registration workflow for users signing with"},{"id":"e962645619acfccd","page":"social","tab":"twitter","label":"Default Profile Type","description":"This option will only take effect when the registration type is set to simplified","keywords":"default profile type this option will only take effect when the registration type"},{"id":"4d7602b902c7ad46","page":"social","tab":"twitter","label":"Enable Twitter Cards","description":"If enabled, Twitter's card are added into the head section of the page.","keywords":"enable twitter cards the enabled twitters card are added into head section page"},{"id":"e379cc091d351dab","page":"social","tab":"twitter","label":"Twitter Card Type","description":"Choose your twitter card type.","keywords":"twitter card type choose your twitter card type"},{"id":"2947220e6874db01","page":"social","tab":"twitter","label":"Import Profile Picture","description":"This option determines if the user is allowed to import their profile picture from Twitter","keywords":"import profile picture this option determines the user allowed import their profile picture"},{"id":"e86fb7ad8af9517a","page":"social","tab":"twitter","label":"Import Profile Cover","description":"This option determines if user is allowed to import their profile cover from Twitter","keywords":"import profile cover this option determines user allowed import their profile cover from"},{"id":"e9bb5e933698a3aa","page":"videos","tab":"general","label":"Enable Videos","description":"This option determines if videos should be enabled on the site","keywords":"enable videos this option determines videos should enabled the site"},{"id":"38c0ca5e31a55bbe","page":"videos","tab":"general","label":"Enable Video Uploads","description":"This option determines if users are allowed to utilize the video uploads functionality.","keywords":"enable video uploads this option determines users are allowed utilize the video uploads"},{"id":"9aa3ab7c808e33d0","page":"videos","tab":"general","label":"Enable External Video Embeds","description":"This option determines if video embedding should be enabled on the site.","keywords":"enable external video embeds this option determines video embedding should enabled the site"},{"id":"dd734c1592826f3e","page":"videos","tab":"general","label":"Use Youtube Privacy-Enhanced Mode","description":"By enabling this, all youtube URLs will be converted to no-cookie version.","keywords":"use youtube privacyenhanced mode enabling this all youtube urls will converted nocookie version"},{"id":"99e6f7f28d1fa9ad","page":"videos","tab":"general","label":"Enable Youtube API","description":"By enabling this feature, all youtube URLs will be processed via API method.","keywords":"enable youtube api enabling this feature all youtube urls will processed via api"},{"id":"71c1e830d82a0796","page":"videos","tab":"general","label":"Youtube API Key","description":"Place your youtube api key here. You can obtain the api key from google console dashboard.","keywords":"youtube api key api key place your youtube here you can obtain the"},{"id":"7a985a983c9e528f","page":"videos","tab":"general","label":"Path to FFMpeg","description":"If video uploads are enabled, FFMpeg is required in order for the system to transcode uploaded videos.","keywords":"path ffmpeg video uploads are enabled ffmpeg required order for the system"},{"id":"cb2fa2a89138d618","page":"videos","tab":"general","label":"Delete Processed Videos","description":"If this option is enabled, the original video would be deleted after the video is encoded.","keywords":"delete processed videos the video this option enabled original would deleted after encoded"},{"id":"ef6876cbd0c36b65","page":"videos","tab":"general","label":"Video Size","description":"Set the dimensions where videos should be resized to. A larger dimension would generally cause the file size to be larger.","keywords":"video size the larger set dimensions where videos should resized dimension would"},{"id":"ae22c69460b476db","page":"videos","tab":"general","label":"Enable CPU Limiting","description":"When this option is enabled, you may set the number of CPU threads to use by FFMpeg","keywords":"enable cpu limiting when this option enabled you may set the number cpu"},{"id":"4ba65a230d24764d","page":"videos","tab":"general","label":"Threads to Use","description":"This option determines the total number of CPU threads to be used by FFMpeg","keywords":"threads use this option determines the total number cpu threads used ffmpeg"},{"id":"687da7750a56ceed","page":"videos","tab":"general","label":"Encode Videos After Upload","description":"This option determines if the video should be encoded as soon as the user uploads the video.","keywords":"encode videos after upload the video this option determines should encoded soon user uploads"},{"id":"05c4389f11e849aa","page":"videos","tab":"general","label":"Maximum Audio Bitrate","description":"Setting a higher bitrate would produce better audio quality but it would also take up more disk space.","keywords":"maximum audio bitrate would setting higher bitrate produce better audio quality but also"},{"id":"862c946ff3f4087b","page":"videos","tab":"layout","label":"Allow Video Embedding","description":"When this option is activated, users will be able to embed videos on your site on another site","keywords":"allow video embedding site when this option activated users will able embed videos"},{"id":"b58c95041de18d1e","page":"videos","tab":"layout","label":"Display Other Videos","description":"When this option is enabled, it will display a list of recent videos beneath the main video item based on the option you choose.","keywords":"display other videos the option when you based item video main videos beneath"},{"id":"c30b4f38b7d95c22","page":"videos","tab":"layout","label":"Total Videos To Display","description":"Determines the total number of videos to be displayed on the item page.","keywords":"total videos display the determines total number videos displayed item page"},{"id":"274e11e5082c50ab","page":"videos","tab":"layout","label":"Total Featured Videos To Display","description":"Determines the total number of featured videos to be displayed on all videos page. Enter 0 (zero) to show all featured videos.","keywords":"total featured videos display videos featured all determines the total number displayed page enter"},{"id":"7c7e5ab02191b319","page":"videos","tab":"layout","label":"Display Hits","description":"Determines if the hit counter should be visible on the item view","keywords":"display hits the determines hit counter should visible item view"},{"id":"ece07b9c558beb5f","page":"videos","tab":"layout","label":"Display Video Duration","description":"Determines if the video duration should be visible on the item view","keywords":"display video duration the determines video duration should visible item view"},{"id":"e94d0bd85b50e17e","page":"videos","tab":"layout","label":"Display People Tags","description":"Determines if the video people tags should be visible on the item view.","keywords":"display people tags the determines video people tags should visible item view"},{"id":"ffc576cfbb944a2c","page":"videos","tab":"layout","label":"Display Tags","description":"Determines if the video tags should be visible on the item view","keywords":"display tags the determines video tags should visible item view"},{"id":"b340097d94bddb8a","page":"videos","tab":"layout","label":"Default Editor For Video Descriptions","description":"Select an editor that you would like to use for the Video Descriptions.<br ><\/i><b>NOTE:<\/b> Auto crawl video link from video creation form only works for <b>No Editor - Textarea Field<\/b> option.","keywords":"default editor for video descriptions video for editor select link field<b> textarea <b>no works only"},{"id":"65ef5e35a0490762","page":"videos","tab":"layout","label":"Insert Logo In Player","description":"This option determines if a video logo should be added on the player","keywords":"insert logo player this option determines video logo should added the player"},{"id":"99a3aae9fc8f6a05","page":"videos","tab":"layout","label":"Logo For Player","description":"Upload a logo that appears in the video player. The logo size should be 24 x 24 pixels","keywords":"logo for player logo the upload that appears video player size should pixels"},{"id":"cc57c174fa1edb51","page":"videos","tab":"layout","label":"Insert Watermark In Player","description":"When this option is activated, a watermark will be added on the video player","keywords":"insert watermark player when this option activated watermark will added the video player"},{"id":"4b6dd6fd27b4ee5a","page":"videos","tab":"layout","label":"Watermark Image","description":"Upload the watermark image that should appear on your videos. Your image size dimension should not exceed 160 px X 160 px (Width X Height)","keywords":"watermark image image should your upload the watermark that appear videos size"},{"id":"2c31449a07666a16","page":"videos","tab":"layout","label":"Watermark Position","description":"This option determines the location the watermark should be appearing on","keywords":"watermark position the this option determines location watermark should appearing"},{"id":"9bc59a551f0e7e37","page":"storage","tab":"general","label":"Avatars","description":"Choose the location to store avatars on the site.","keywords":"avatars the choose location store avatars site"},{"id":"91f3a2c0e4424c87","page":"storage","tab":"general","label":"Files","description":"Choose the location to store files. Files includes conversation attachments, files uploaded in the files application, and files shared in groups.","keywords":"files files the choose location store includes conversation attachments uploaded application"},{"id":"5daaf223b01f8f3e","page":"storage","tab":"general","label":"Photos\t\n\t\t\n\tSync to Amazon immediately after user uploaded photos","description":"Choose the location to store photos","keywords":"photossync amazon immediately after user uploaded photos choose the location store photos"},{"id":"554cfab3938e21d9","page":"storage","tab":"general","label":"Videos","description":"Specify the location to store videos.","keywords":"videos specify the location store videos"},{"id":"b22f0418e8ac915e","page":"storage","tab":"general","label":"Audio","description":"Specify the location to store audio.","keywords":"audio specify the location store audio"},{"id":"1ccae4dae8c77398","page":"storage","tab":"general","label":"Cached Images From Links","description":"Choose the location to store cached images from links.","keywords":"cached images from links choose the location store cached images from links"},{"id":"4356e9a17ebe7a99","page":"storage","tab":"general","label":"Access Key ID","description":"You will need to copy the access key id from your Amazon account.","keywords":"access key you will need copy the access key from your amazon"},{"id":"952bf87c967660b7","page":"storage","tab":"general","label":"Secret key","description":"You will need to copy the secret access key from your Amazon account.","keywords":"secret key you will need copy the secret access key from your"},{"id":"e12290190538987b","page":"storage","tab":"general","label":"Bucket path","description":"Specify the bucket path to Amazon S3. If you did not create one yet, EasySocial will automatically set this up for you.","keywords":"bucket path you specify yet this set automatically will easysocial create one"},{"id":"b75e89e9de2c2296","page":"storage","tab":"general","label":"Use SSL Layer","description":"By enabling this option, files and images would be served with the (https:\/\/) prefix.","keywords":"use ssl layer enabling this option files and images would served with the"},{"id":"d2eda59819bd65fd","page":"storage","tab":"general","label":"Delete Files After Upload","description":"When this option is enabled, local files will be deleted after the files are uploaded to Amazon.","keywords":"delete files after upload files when this option enabled local will deleted after the"},{"id":"7b5057f4d0938be0","page":"storage","tab":"general","label":"Transfer limit","description":"Determines how many items to be synchronized with Amazon S3's server each time the cron process executes.","keywords":"transfer limit determines how many items synchronized with amazon s3s server each"},{"id":"1e8ca27b8fe38d3d","page":"storage","tab":"general","label":"Storage path","description":"Choose a location where you want the storage files to be stored in.","keywords":"storage path choose location where you want the storage files stored"},{"id":"dd8c5eff0fd4dd0b","page":"storage","tab":"general","label":"Storage class","description":"Define the storage class that should be used. Reduced redundancy is generally cheaper but is not as stable as the standard storage classs.","keywords":"storage class the storage define class that should used reduced redundancy generally"},{"id":"5daaf223b01f8f3e","page":"storage","tab":"storage","label":"Photos","description":"In this section, you will be able to configure how should the photo files be stored on the site. The path defined here should be relative to your Joomla's root directory.","keywords":"photos the should this site root joomlas your relative here defined"},{"id":"9bc59a551f0e7e37","page":"storage","tab":"storage","label":"Avatars","description":"In this section, you'll be able to configure the behaviour of the storage path for user items","keywords":"avatars the this section youll able configure behaviour storage path for"},{"id":"554cfab3938e21d9","page":"storage","tab":"storage","label":"Videos","description":"Specify the video upload storage path in your Joomla! site. The path should be relative to your Joomla root folder.","keywords":"videos the path your joomla specify video upload storage site should"},{"id":"b22f0418e8ac915e","page":"storage","tab":"storage","label":"Audio","description":"Specify the audio upload storage path in your Joomla! site. The path should be relative to your Joomla root folder.","keywords":"audio the path your joomla specify audio upload storage site should"},{"id":"f328194c5ebabee4","page":"storage","tab":"storage","label":"Comment Attachments","description":"Set the storage path for comment attachments","keywords":"comment attachments set the storage path for comment attachments"},{"id":"5a7c1ee9fe068ca6","page":"storage","tab":"storage","label":"Conversation Attachments","description":"If you want to store the files on a different path, you may set it here.","keywords":"conversation attachments you want store the files different path may set here"},{"id":"ad4acecae34f8fe9","page":"storage","tab":"storage","label":"Links Images","description":"Determines the cache location for images stored when parsing links. Set the relative path that is relative to your Joomla site.","keywords":"links images relative the determines joomla your that path set parsing links"},{"id":"91f3a2c0e4424c87","page":"storage","tab":"storage","label":"Files","description":"In this section, you will be able to configure how should the files be stored on the site. The path defined here should be relative to your Joomla's root directory.","keywords":"files the should this path root joomlas your relative here defined"},{"id":"f10945afbd1939de","page":"layout","tab":"general","label":"Zero as Plural","description":"In language translation, plural form is used for zero.","keywords":"zero plural language translation plural form used for zero"},{"id":"8c2857a9ad1d8f31","page":"layout","tab":"general","label":"Logo","description":"This option allows you to define a custom logo for your e-mails","keywords":"logo this option allows you define custom logo for your emails"},{"id":"b5571660de39b02b","page":"layout","tab":"general","label":"Use Solid Background Colour","description":"COM_ES_LOGIN_USE_STATIC_BACKGROUND_COLOUR_DESC","keywords":"use solid background colour comesloginusestaticbackgroundcolourdesc"},{"id":"35cb9e66ff801a81","page":"layout","tab":"general","label":"Background Colour","description":"COM_ES_LOGIN_STATIC_BACKGROUND_COLOUR_DESC","keywords":"background colour comesloginstaticbackgroundcolourdesc"},{"id":"b840aa332b27c205","page":"layout","tab":"general","label":"Use Custom Background Image","description":"Determine whether easysocial login page should use a custom background image that are uploaded in the upload form below.","keywords":"use custom background image determine image form upload the uploaded are that background whether"},{"id":"da7b08d7083798e4","page":"layout","tab":"general","label":"Upload Background Image","description":"Upload background image here. Image dimension recommended to be in 4:3 ratio and minimum size of 780px X 400px.","keywords":"upload background image image upload background here dimension recommended ratio and minimum size"},{"id":"b7eaec38a504210a","page":"layout","tab":"mobile","label":"Allow User to Zoom on Mobile","description":"This option determines if the scaling feature on a mobile web browser should be enabled. This option is also dependent on your current template of your site.","keywords":"allow user zoom mobile this option your template current dependent also enabled browser should"},{"id":"5eceee9c20dd2580","page":"layout","tab":"mobile","label":"Render Mobile Shortcut In Header","description":"By enabling this option, EasySocial will generate a shortcut icon for mobile devices. If you have your own plugins to render this, you may turn this off.","keywords":"render mobile shortcut header this you enabling turn may render plugins own your have"},{"id":"817434295a673aed","page":"layout","tab":"mobile","label":"Icon","description":"Icon for the shortcut created on the device homescreen. It should be square and should be at least 192px * 192px","keywords":"icon the should 192px icon for shortcut created device homescreen square"},{"id":"49ee3087348e8d44","page":"layout","tab":"mobile","label":"Name","description":"Title used in the banner of the shortcut","keywords":"name the title used banner shortcut"},{"id":"910049cf44f5e999","page":"layout","tab":"mobile","label":"Short Name","description":"Name for the shortcut created on the device homescreen","keywords":"short name the name for shortcut created device homescreen"},{"id":"7360eb0c45082b78","page":"layout","tab":"styling","label":"Primary Button Background Colour","description":"Set the primary button colour for buttons on the site","keywords":"primary button background colour the set primary button colour for buttons site"},{"id":"5f4f110d067c1921","page":"layout","tab":"styling","label":"Primary Button Text Colour","description":"Set the primary button text colour for buttons on the site","keywords":"primary button text colour the set primary button text colour for buttons site"},{"id":"eb98aefc32120b6f","page":"layout","tab":"styling","label":"Success Button Background Colour","description":"Set the success button colour on the site","keywords":"success button background colour the set success button colour site"},{"id":"a5e9059e5de8971e","page":"layout","tab":"styling","label":"Success Button Text Colour","description":"Set the success button text colour for buttons on the site","keywords":"success button text colour the set success button text colour for buttons site"},{"id":"9d5aa74715d3bc0b","page":"layout","tab":"styling","label":"Danger Button Background Colour","description":"Set the danger button colour on the site","keywords":"danger button background colour the set danger button colour site"},{"id":"c36acf3ed3be4c6e","page":"layout","tab":"styling","label":"Danger Button Text Colour","description":"Set the danger button text colour for buttons on the site","keywords":"danger button text colour the set danger button text colour for buttons site"},{"id":"5b02028f081e2caa","page":"layout","tab":"styling","label":"Standard Button Background Colour","description":"Set the standard button colour on the site","keywords":"standard button background colour the set standard button colour site"},{"id":"8ccd0da1534b5444","page":"layout","tab":"styling","label":"Standard Button Text Colour","description":"Set the standard button text colour for buttons on the site","keywords":"standard button text colour the set standard button text colour for buttons site"},{"id":"f85a1b5b2da588d9","page":"layout","tab":"styling","label":"Avatar Style","description":"Determines the style for the avatars that appears on EasySocial","keywords":"avatar style the determines style for avatars that appears easysocial"},{"id":"8db89b4eeb8e7abc","page":"layout","tab":"toolbars","label":"Display Toolbar","description":"This option determines if the toolbar should be visible on the extension. It is useful when you want to render the toolbar with a module instead","keywords":"display toolbar the toolbar this option determines should visible extension useful when"},{"id":"98bfaaf7aa6e8dab","page":"layout","tab":"toolbars","label":"Display Search","description":"Determines if the search box should be visible on the toolbar","keywords":"display search the determines search box should visible toolbar"},{"id":"6e3f22ebfcd68b82","page":"layout","tab":"toolbars","label":"Display Toolbar For Guests","description":"Determines if the toolbar should be visible by guest user.","keywords":"display toolbar for guests determines the toolbar should visible guest user"},{"id":"ae03100a914bbe21","page":"layout","tab":"toolbars","label":"Display Search For Guests","description":"Determines if the toolbar search should be visible to guest user.","keywords":"display search for guests determines the toolbar search should visible guest user"},{"id":"b37931388e5699b8","page":"layout","tab":"toolbars","label":"Display EasyBlog Menus in Dropdown","description":"This option determines if EasyBlog menu items should be visible in the dropdown toolbar (wireframe theme)","keywords":"display easyblog menus dropdown this option determines easyblog menu items should visible the dropdown"},{"id":"e6f95c18f591cf93","page":"layout","tab":"toolbars","label":"Display EasyDiscuss Menus in Dropdown","description":"This option determines if EasyDiscuss menu items should be visible in the dropdown toolbar (wireframe theme)","keywords":"display easydiscuss menus dropdown this option determines easydiscuss menu items should visible the dropdown"},{"id":"d79bd7ab57ae8343","page":"layout","tab":"toolbars","label":"Toolbar Color","description":"This option determines the toolbar background color that is used","keywords":"toolbar color this option determines the toolbar background color that used"},{"id":"779a68e20d5ee1a0","page":"layout","tab":"toolbars","label":"Active Color","description":"This option determines the color used for the active state within the toolbar","keywords":"active color the this option determines color used for active state within"},{"id":8903861290617267,"page":"layout","tab":"toolbars","label":"Text Color","description":"This option determines the color of the text within the toolbar","keywords":"text color the this option determines color text within toolbar"},{"id":"475c80ecff56299d","page":"layout","tab":"toolbars","label":"Border Color","description":"This option determines the border color of the toolbar","keywords":"border color the this option determines border color toolbar"},{"id":"70b051b79b908919","page":"sharer","tab":"general","label":"Enable Sharer","description":"This option determines if EasySocial should display share buttons on other sites","keywords":"enable sharer this option determines easysocial should display share buttons other sites"},{"id":"23adc3c8c5729fd5","page":"sharer","tab":"general","label":"Display Sharer Codes to Users","description":"This option determines if EasySocial should display the embed codes to users under the Apps section.","keywords":"display sharer codes users the this option determines easysocial should display embed codes users"},{"id":"190f98c2cacb55b8","page":"sharer","tab":"general","label":"Button Style","description":"Determine the button style to be used by the embed codes","keywords":"button style the determine button style used embed codes"},{"id":"ed7566b130f07017","page":"sharer","tab":"general","label":"Embed Button Colour","description":"Set a custom colour for the embed button that appears","keywords":"embed button colour set custom colour for the embed button that appears"},{"id":"f6b979a27988c329","page":"sharer","tab":"general","label":"Embed Button Icon","description":"You may upload an image to be used as the icon for the embed button. Ideally, the image should be transparent to ensure that it looks nice with the background","keywords":"embed button icon the image you should with nice looks that ensure transparent"},{"id":"f8d6b774597c28fb","page":"sharer","tab":"general","label":"Embed Button Text","description":"Set the text that should appear on the button","keywords":"embed button text the set text that should appear button"},{"id":"f5faffe472f1d738","page":"sharer","tab":"general","label":"Embed Button Text Colour","description":"Set a custom colour for the embed button if you have configured to display text","keywords":"embed button text colour set custom colour for the embed button you have configured"},{"id":"b19d9e70c0f1a19c","page":"sharer","tab":"general","label":"Popup Window Colour","description":"Set the desired colour for the frames in the popup window","keywords":"popup window colour the set desired colour for frames popup window"},{"id":"8f673eecc4b01158","page":"sharer","tab":"general","label":"Popup Border Colour","description":"Set the desired colour for the borders in the popup window","keywords":"popup border colour the set desired colour for borders popup window"},{"id":"4b2c67ab2e4221d1","page":"sharer","tab":"general","label":"Embed Codes","description":"Copy these codes and place them on any site that you want to render the share button","keywords":"embed codes copy these codes and place them any site that you"}]}